Revit 2027 API
UpdaterInfo Class
 Information of an updater, such as: Name, AdditionalInformation, name of the application that owns the updater, etc.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.UpdaterInfo
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class UpdaterInfo : IDisposable
Public Class UpdaterInfo
	Implements IDisposable
public ref class UpdaterInfo : IDisposable
type UpdaterInfo =
    class
        interface IDisposable
    end
The UpdaterInfo type exposes the following members.
Properties
Name | Description
AdditionalInformation |  Additional information about the updater.
ApplicationName |  Name of the application that owns the updater.
IsOptional |  Whether the updater is optional or not.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
UpdaterName |  Name of the updater.
Top
Methods
Name | Description
Dispose | Releases all resources used by the UpdaterInfo
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
Autodesk.Revit.DB Namespace